Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_vision_master_e_213.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_vision_master_e_213.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.0=Internal (default)
heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=0
heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.1=External 32K
heltec_vision_master_e_213.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=1

heltec_vision_master_e_213.build.defines=-D{build.band}  -DMCU_ESP32_S3 -DHELTEC_BOARD=36 -DVision_Master_E_213 -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}

heltec_vision_master_e_213.menu.EraseFlash.none=Disabled
heltec_vision_master_e_213.menu.EraseFlash.none.upload.erase_cmd=
heltec_vision_master_e_213.menu.EraseFlash.all=Enabled
heltec_vision_master_e_213.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################